tutorials/basic/partiallyRarefiedFlow/twoCylinders2D/simpleFoam_Argon_Kn0.3464/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile {
  version     2.0;
  format      ascii;
  class       dictionary;
  object      extrudeMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

constructFrom       patch;

sourceCase          ".";

sourcePatches       (z1);

exposedPatchName    z2;

flipNormals         false;

extrudeModel        linearNormal;

nLayers             1;

expansionRatio      1.0;

linearNormalCoeffs {
  thickness       1;
}

mergeFaces          false;

// ************************************************************************* //
