tutorials/basic/partiallyRarefiedFlow/twoCylinders2D/simpleFoam_Argon_Kn0.3464/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile {
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes {
default         steadyState;
}

gradSchemes {
default         Gauss linear;
}

divSchemes {
default         none;
  div(phi,U)      Gauss linear;
  div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes {
default         Gauss linear corrected;
}

interpolationSchemes {
default         linear skewCorrected;
}

snGradSchemes {
default         corrected;
}


// ************************************************************************* //
