tutorials/basic/partiallyRarefiedFlow/twoCylinders2D/simpleFoam_Argon_Kn0.3464/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile {
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers {
  p
  {
    solver          PCG;
    preconditioner  DIC;
    tolerance       1e-08;
    relTol          0.;
    minIter         3;
    maxIter         1000;
  }


  pFinal
  {
    solver          PCG;
    preconditioner  DIC;
    tolerance       1e-10;
    relTol          0.;
    minIter         3;
    maxIter         1000;
  }

  U
  {
    solver          smoothSolver;
    smoother        symGaussSeidel;
    tolerance       1e-07;
    relTol          0.;
  }

  UFinal
  {
    solver          smoothSolver;
    smoother        symGaussSeidel;
    tolerance       1e-09;
    relTol          0.;
  }
}

SIMPLE {
  nNonOrthogonalCorrectors 0;             // not needed to converg at each time step
  residualControl
  {
    p               1e-10;
    U               1e-10;
  }

  consistent yes;
}

relaxationFactors {
  fields
  {
    p      1;
    pFinal 1;
  }

  equations
  {
    U      0.9;
    UFinal 0.9;
  }
}

// ************************************************************************* //
